In [3]:
import pandas as pd
from collections import OrderedDict

In [14]:
friend_list= [
    ['name', ['John', 'Jenny','Nate']],
    ['age', [25,30, 35]],
    ['job', ['student','developer','teacher']]
]

In [15]:
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df.head()

    name  age        job
0   John   25    student
1  Jenny   30  developer
2   Nate   35    teacher

In [16]:
df[1:3] #1~2index

    name  age        job
1  Jenny   30  developer
2   Nate   35    teacher

In [17]:
df= df[1:3]

In [18]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   35    teacher

In [20]:
friend_list= [
    ['name', ['John', 'Jenny','Nate']],
    ['age', [25,30, 35]],
    ['job', ['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df.head()

    name  age        job
0   John   25    student
1  Jenny   30  developer
2   Nate   35    teacher

In [21]:
df.loc[[0,2]]

   name  age      job
0  John   25  student
2  Nate   35  teacher

### by column condition

In [24]:
df[df.age>25]

    name  age        job
1  Jenny   30  developer
2   Nate   35    teacher

In [26]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   35    teacher

In [28]:
df[(df.age>25) & (df.name == 'Nate')]

   name  age      job
2  Nate   35  teacher

### filter column

#by index

In [33]:
friend_list = [
    ['John', 25, 'student'],
    ['Jenny', 39, 'developer'],
    ['Nate', 35, 'teacher']]
df= pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  25    student
1  Jenny  39  developer
2   Nate  35    teacher

In [36]:
df.iloc[:,0:2] #앞 row, 뒤 col

       0   1
0   John  25
1  Jenny  39
2   Nate  35

#by column name

In [39]:
df= pd.read_csv('friend_list_no head.txt', header= None, names=['name', 'age', 'job'])
df

    name  age        job
0   john   20    student
1  jenny   30    teacher
2   nate   40    dentist
3  brian   45    manager
4  chris   25     intern
5  julia   40  developer

In [41]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   john   20
1  jenny   30
2   nate   40
3  brian   45
4  chris   25
5  julia   40

In [42]:
df.filter(items = ['age', 'job'])

   age        job
0   20    student
1   30    teacher
2   40    dentist
3   45    manager
4   25     intern
5   40  developer

In [43]:
df.filter(like ='a', axis=1) #col에 a가 있는 것만

    name  age
0   john   20
1  jenny   30
2   nate   40
3  brian   45
4  chris   25
5  julia   40

In [46]:
df.filter(regex ='b$', axis=1) # col이 b로 끝나는 것만

         job
0    student
1    teacher
2    dentist
3    manager
4     intern
5  developer